phynics/axoloty/Embedded/swift/sdkconfig.defaults
# Target chip
CONFIG_IDF_TARGET="esp32c6"

# Enable reproducible builds (deterministic .bin output)
CONFIG_APP_REPRODUCIBLE_BUILD=y

# Swift app tuning
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_FREERTOS_HZ=1000
